import { Translation } from "./type";

export const gr: Translation = {
  messages: {
    processing: "Επεξεργασία...",
    deviceIsDisconnected: "Η συσκευή είναι αποσυνδεδεμένη!",
    connectingInProgress: "Σύνδεση σε εξέλιξη...",
    settingsHaveBeenSaved: "Οι ρυθμίσεις σας έχουν αποθηκευτεί!",
    configLoadedSuccessful: "Η φόρτωση των ρυθμίσεων ήταν επιτυχής!",
    overrideFileWarning: {
      header: "Προειδοποίηση!",
      message: {
        theFileText: "Το αρχείο",
        areYouSureToOverrideText: "υπάρχουν! Είστε σίγουροι ότι θέλετε να παρακάμψετε αυτό το αρχείο;",
      },
      buttons: {
        yes: "Παράκαμψη",
        no: "Όχι",
      },
    },
    unsupportedConfigurationFile: {
      header: "Σφάλμα!",
      text: "Μη υποστηριζόμενο ή σπασμένο αρχείο ρυθμίσεων!",
    },
    pleaseWait: "Παρακαλώ περιμένετε...",
    connectingToMotor: "Σύνδεση στον κινητήρα...",
    noDeviceFound: "Δεν βρέθηκε συσκευή!",
    cantEstablishingConnection:
      "Δεν μπορεί να δημιουργήσει σύνδεση με τον κινητήρα! Ελέγξτε την επανεκκίνηση του τέλους σύνδεσης!",
    connectedTo: "Συνδέεται με",
    readBasSuccess: {
      basTypeLevel: "Επίπεδα",
      basTypeGeneral: "Γενικά",
      first: "Διαβάστε",
      second: "παράμετροι με επιτυχία!",
    },
    readPedalAssistSuccess: "Διαβάστε τις παραμέτρους Pedal Assist με επιτυχία!",
    readThrottleHandleSuccess: "Ανάγνωση παραμέτρων λαβής γκαζιού με επιτυχία",
    readAllSuccess: "Διαβάστε όλες τις παραμέτρους με επιτυχία!",
    somethingWentWrong: "Κάτι πήγε στραβά! Ημερολόγιο:",
    writeSuccess: {
      levels: "Επίπεδα",
      general: "Γενικά",
      pedalAssist: "Υποβοήθηση πεντάλ",
      throttleHandle: "Χειρολαβή γκαζιού",
      first: "Γράψτε",
      second: "παράμετροι με επιτυχία!",
    },
    writeAllSuccess: "Γράψτε όλες τις παραμέτρους με επιτυχία!",
  },
  buttons: {
    cancel: "Ακύρωση",
  },
  errors: {
    writeBasErrors: {
      "0": "Προστασία χαμηλής μπαταρίας εκτός εμβέλειας, παρακαλούμε επαναφέρετε!",
      "1": "Όριο ρεύματος εκτός εύρους, παρακαλώ επαναφέρετε!",
      "2": "Όριο ρεύματος για το PAS0 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "3": "Όριο ταχύτητας για το PAS0 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "4": "Όριο ρεύματος για το PAS1 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "5": "Όριο ταχύτητας για PAS1 εκτός εύρους, επαναφέρετε το!",
      "6": "Όριο ρεύματος για το PAS2 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "7": "Όριο ταχύτητας για PAS2 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "8": "Όριο ρεύματος για το PAS3 εκτός εύρους, επαναφέρετε το!",
      "9": "Όριο ταχύτητας για PAS3 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "10": "Όριο ρεύματος για το PAS4 εκτός εύρους, επαναφέρετε το!",
      "11": "Όριο ταχύτητας για PAS4 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "12": "Όριο ρεύματος για το PAS5 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "13": "Όριο ταχύτητας για PAS5 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "14": "Όριο ρεύματος για το PAS6 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "15": "Όριο ταχύτητας για PAS6 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "16": "Όριο ρεύματος για το PAS7 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "17": "Όριο ταχύτητας για PAS7 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "18": "Όριο ρεύματος για το PAS8 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "19": "Όριο ταχύτητας για PAS8 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "20": "Όριο ρεύματος για το PAS9 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "21": "Όριο ταχύτητας για PAS9 εκτός εύρους, παρακαλώ επαναφέρετε!",
      "22": "Διάμετρος τροχού εκτός εύρους, επαναφέρετε, παρακαλώ!",
      "23": "Τα σήματα του μετρητή ταχύτητας είναι εκτός εμβέλειας, παρακαλώ επαναφέρετε!",
      default: "Πρόβλημα επικοινωνίας, παρακαλώ επαναφέρετε!",
    },
    writePasErrors: {
      "0": "Σφάλμα τύπου αισθητήρα πεντάλ, παρακαλώ επαναφέρετε!",
      "1": "Σφάλμα καθορισμένου επιπέδου βοήθειας, παρακαλώ επαναφέρετε!",
      "2": "Σφάλμα ορίου ταχύτητας, παρακαλώ επαναφέρετε!",
      "3": "Έναρξη Τρέχον εκτός εμβέλειας, παρακαλώ επαναφέρετε!",
      "4": "Σφάλμα λειτουργίας αργής εκκίνησης, παρακαλώ επαναφέρετε!",
      "5": "Έναρξη Βαθμός εκτός εμβέλειας, παρακαλώ επαναφέρετε!",
      "6": "Σφάλμα λειτουργίας εργασίας, παρακαλώ επαναφέρετε!",
      "7": "Stop Delay εκτός εμβέλειας, παρακαλώ επαναφέρετε!",
      "8": "Τρέχουσα αποσύνθεση εκτός εύρους, παρακαλώ επαναφέρετε!",
      "9": "Stop Decay εκτός εμβέλειας, παρακαλώ επαναφέρετε!",
      "10": "Κρατήστε το Current εκτός εμβέλειας, παρακαλώ επαναφέρετε!",
      default: "Άγνωστο σφάλμα, παρακαλώ επαναφέρετε!",
    },
    writeThrErrors: {
      "0": "Τάση εκκίνησης εκτός εμβέλειας, παρακαλώ επαναφέρετε!",
      "1": "End Voltage out of range, παρακαλώ επαναφέρετε!",
      "2": "Σφάλμα λειτουργίας, παρακαλώ επαναφέρετε!",
      "3": "Σφάλμα καθορισμένου βοηθήματος, παρακαλώ επαναφέρετε!",
      "4": "Σφάλμα ορίου ταχύτητας, παρακαλώ επαναφέρετε!",
      "5": "Έναρξη Τρέχον εκτός εμβέλειας, παρακαλώ επαναφέρετε!",
      default: "Άγνωστο σφάλμα, παρακαλώ επαναφέρετε!",
    },
  },
  mainRouter: {
    home: "Αρχική σελίδα",
    settings: "Ρυθμίσεις",
    help: "Βοήθεια",
  },
  main: {
    label_language: "Γλώσσα",
    object_Profile: {
      header: "Προφίλ",
      open: "Ανοίξτε το",
      save_as: "Αποθήκευση ως",
      save: "Αποθήκευση",
      default_configuration_string: "Προεπιλεγμένη διαμόρφωση (δεν έχει καθοριστεί αρχείο)",
      popup_header: "Αποθήκευση διαμόρφωσης ως",
      popup_placeholder: "Εισάγετε το όνομα του αρχείου εδώ",
      popup_button_label: "Αποθήκευση",
    },
    object_Motor: {
      header: "Κινητήρας",
      read_all: "Διαβάστε",
      write_all: "Γράψτε",
      connect: "Συνδέστε το",
      disconnect: "Αποσύνδεση",
      status: {
        disconnected: "αποσυνδεδεμένο",
        connecting: "σύνδεση",
        connected: "συνδεδεμένο",
        error: "σφάλμα",
      },
      motor_info: {
        status: "Κατάσταση",
        manufacturer: "Κατασκευαστής",
        model: "Μοντέλο",
        hardware_version: "Έκδοση υλικού",
        firmware_version: "Έκδοση υλικολογισμικού",
        nominal_voltage: "Ονομαστική τάση",
        max_current: "Μέγιστο ρεύμα",
      },
    },
  },
  settings: {
    toolbar: {
      general: "Γενικά",
      levels: "Επίπεδα",
      pedal: "Πετάλι",
      throttle: "Γκάζι",
    },
    header: {
      readButtonText: "Διαβάστε",
      writeButtonText: "Αποθήκευση",
    },
    tabs: {
      general: {
        header: "Γενικά",
        lowBatteryProtection: "Προστασία χαμηλής μπαταρίας",
        currentLimit: "Όριο ρεύματος",
        speedMeterType: {
          text: "Τύπος μετρητή ταχύτητας",
          types: ["Εξωτερικός, μετρητής τροχού", "Εσωτερικός, μετρητής κινητήρα", "Ανά φάση κινητήρα"],
        },
        speedMeterSignals: "Σήματα μετρητή ταχύτητας",
        wheelDiameter: {
          text: "Διάμετρος τροχού",
          types: [
            "16 ίντσες",
            "17 ίντσες",
            "18 ίντσες",
            "19 ίντσες",
            "20 ίντσες",
            "21 ίντσες",
            "22 ίντσες",
            "23 ίντσες",
            "24 ίντσες",
            "25 ίντσες",
            "26 ίντσες",
            "27 ίντσες",
            "700C",
            "28 ίντσες",
            "29 ίντσες",
            "30 ίντσες",
          ],
        },
      },
      levels: {
        header: "Επίπεδα βοήθειας",
        level: "Επίπεδο",
        current: "Τρέχον",
        speed: "Ταχύτητα",
        popoverCurrentLimitHeader: "Όριο ρεύματος για επίπεδο",
        popoverSpeedLimitHeader: "Όριο ταχύτητας για επίπεδο",
      },
      pedal: {
        header: "Υποβοήθηση πεντάλ",
        pedalSensorType: {
          text: "Τύπος αισθητήρα πεντάλ",
          types: ["Κανένα", "DH-Sensor-12", "BB-Sensor-32", "DoubleSignal-24"],
        },
        designatedAssistLevel: {
          text: "Καθορισμένο επίπεδο βοήθειας",
          types: ["Με εντολή της οθόνης", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
        },
        speedLimit: {
          text: "Όριο ταχύτητας",
          types: [
            "Με εντολή της οθόνης",
            "15km/h",
            "16km/h",
            "17km/h",
            "18km/h",
            "19km/h",
            "20km/h",
            "21km/h",
            "22km/h",
            "23km/h",
            "24km/h",
            "25km/h",
            "26km/h",
            "27km/h",
            "28km/h",
            "29km/h",
            "30km/h",
            "31km/h",
            "32km/h",
            "33km/h",
            "34km/h",
            "35km/h",
            "36km/h",
            "37km/h",
            "38km/h",
            "39km/h",
            "40 km/h",
          ],
        },
        startCurrent: "Έναρξη ρεύματος",
        slowStartMode: "Λειτουργία αργής ��κκίνησης",
        startDegree: "Έναρξη Πτυχίο",
        workMode: {
          text: "Λειτουργία εργασίας",
          types: ["Απροσδιόριστο"],
        },
        stopDelay: "Καθυστέρηση διακοπής",
        currentDecay: "Τρέχουσα αποσύνθεση",
        stopDecay: "Σταματήστε τη φθορά",
        keepCurrent: "Διατηρήστε το ρεύμα",
      },
      throttle: {
        header: "Βοήθεια γκαζιού",
        startVoltage: "Τάση έναρξης",
        endVoltage: "Τάση τέλους",
        mode: {
          text: "Λειτουργία",
          types: ["Ταχύτητα", "Τρέχον"],
        },
        designatedAssistLevel: {
          text: "Καθορισμένο επίπεδο βοήθειας",
          types: ["Με εντολή της οθόνης", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
        },
        speedLimit: {
          text: "Όριο ταχύτητας",
          types: [
            "Με εντολή της οθόνης",
            "15km/h",
            "16km/h",
            "17km/h",
            "18km/h",
            "19km/h",
            "20km/h",
            "21km/h",
            "22km/h",
            "23km/h",
            "24km/h",
            "25km/h",
            "26km/h",
            "27km/h",
            "28km/h",
            "29km/h",
            "30km/h",
            "31km/h",
            "32km/h",
            "33km/h",
            "34km/h",
            "35km/h",
            "36km/h",
            "37km/h",
            "38km/h",
            "39km/h",
            "40 km/h",
          ],
        },
        startCurrent: "Έναρξη ρεύματος",
      },
    },
  },
  help: {
    about: {
      header: "Σχετικά με την εφαρμογή",
      p1: "Εργαλείο διαμόρφωσης για τη σειρά κινητήρων Bafang BBS.",
      author: "Συγγραφέας",
    },
    connection: {
      header: "Σύνδεση",
      p1:
        "Για να συνδεθείτε με το χειριστήριο του ηλεκτρικού ποδηλάτου σας από τη σειρά Bafang BBS χρειάζεστε έναν προσαρμογέα USB-OTG, έναν προσαρμογέα USB σε σειριακό με θηλυκά βύσματα τύπου Julet στο άκρο.",
      p2:
        'Μπορείτε επίσης να αγοράσετε ένα "αυθεντικό" καλώδιο προγραμματισμού USB, αλλά είναι απλώς ένας υπερτιμημένος προσαρμογέας USB σε σειριακό με το κατάλληλο βύσμα για το καλώδιο του ελεγκτή BBS.',
    },
    general: {
      header: "Γενικά",
      lowBatteryProtection:
        "Αυτή είναι η τάση στην οποία ο ελεγκτής θα σταματήσει τον κινητήρα για να προστατεύσει την μπαταρία σας από υπερβολική εκφόρτιση. Θα πρέπει να έχει ρυθμιστεί σωστά από τον κατασκευαστή και δεν χρειάζεται να την αλλάξετε. Για τα πακέτα μπαταριών 13S τα 41V είναι η προεπιλεγμένη τιμή.",
      currentLimit:
        "Αυτό είναι το μέγιστο ρεύμα που επιτρέπεται να διαρρέει τον κινητήρα. Για παράδειγμα, ο κινητήρας σας είναι 25Α, μπορείτε να το ρυθμίσετε στα 20Α για να τον κρατήσετε ασφαλή, αν θέλετε. Δεν συνιστάται η ρύθμιση υψηλότερου ρεύματος από το ονομαστικό. Ακόμη και αν ρυθμιστεί στα 25Α, το ρεύμα αιχμής θα είναι υψηλότερο, οπότε καλύτερα να μην ρυθμίσετε περισσότερο από αυτό.",
      speedMeterType:
        "Με αυτό επιλέγετε τον μετρητή ταχύτητας που χρησιμοποιείται στο ποδήλατό σας. Για τα κιτ BBS είναι εξωτερικό. Αυτή η παράμετρος έχει οριστεί από τον κατασκευαστή και αν η εγκατάστασή σας δεν είναι προσαρμοσμένη τότε δεν χρειάζεται να την αλλάξετε.",
      speedMeterSignals:
        "Εδώ μπορείτε να ορίσετε πόσα σήματα ανά περιστροφή παράγει ο αισθητήρας σας. Εάν χρησιμοποιείτε τον εξωτερικό αισθητήρα με μαγνήτη, παράγει ένα σήμα ανά περιστροφή του τροχού. Αυτή η παράμετρος έχει οριστεί από τον κατασκευαστή και αν η εγκατάστασή σας δεν είναι προσαρμοσμένη τότε δεν χρειάζεται να την αλλάξετε.",
      wheelDiameter:
        "Η διάμετρος του τροχού θα πρέπει να ταιριάζει με το μέγεθος του τροχού κίνησης (επομένως το ποδήλατό σας μπορεί να έχει δύο διαφορετικού μεγέθους τροχούς). Η ρύθμιση της διαμέτρου σε μικρότερο μέγεθος από αυτό που πραγματικά είναι θα αυξήσει την ταχύτητά σας, αλλά επίσης μπορεί εύκολα να οδηγήσει σε βλάβη του κινητήρα.",
      endText:
        "Όταν τελειώσετε με τη ρύθμιση των Γενικών ρυθμίσεων, μπορείτε να χρησιμοποιήσετε το κουμπί WRITE σε αυτή την καρτέλα του προγράμματος για να τις γράψετε στον ελεγκτή σας. Μπορείτε επίσης να χρησιμοποιήσετε το κουμπί READ ανά πάσα στιγμή για να τις διαβάσετε (αυτό θα αντικαταστήσει όλες τις τιμές στο General. Αυτό δεν θα αντικαταστήσει οποιεσδήποτε άλλες ρυθμίσεις.",
    },
    levels: {
      header: "Επίπεδα βοήθειας",
      p1:
        "Αυτές είναι όλες οι πιθανές ρυθμίσεις υποβοήθησης (τόσο για την υποβοήθηση πεντάλ όσο και για τη χειρολαβή γκαζιού με τη χρήση ενός από αυτά).",
      p2:
        "Είναι σημαντικό να αναφέρετε ότι το ρεύμα Assist 0 και τα όρια ταχύτητας πρέπει να ρυθμιστούν στο 1, εάν θέλετε να μπορείτε να χρησιμοποιήσετε τη λαβή του γκαζιού σας με επιλεγμένο το Pedal Assist 0 στην οθόνη LCD.",
      p3:
        "Συνήθως το Assist 0 είναι ρυθμισμένο στο 0, ώστε να μπορείτε να χρησιμοποιείτε το ποδήλατό σας χωρίς βοήθεια, αν θέλετε.",
      p4:
        "Να είστε προσεκτικοί στον καθορισμό αυτών των επιπέδων. Εάν ρυθμίσετε το ρεύμα πολύ χαμηλά, ο κινητήρας δεν θα είναι σε θέση να κινήσει το ποδήλατο και μπορεί να υποστεί κάποια ζημιά. Εάν ρυθμίσετε το ρεύμα του πρώτου επιπέδου υποβοήθησης πολύ υψηλά τότε η επιτάχυνση κατά την εκκίνηση θα είναι σημαντική. Αυτό μπορεί να προκαλέσει ζημιά στα εσωτερικά γρανάζια ή να σας κάνει να πέσετε από το ποδήλατό σας.",
      p5:
        "Το όριο ταχύτητας καθορίζει σε ποια ταχύτητα (% της μέγιστης ταχύτητας που έχει οριστεί από την οθόνη LCD) ο κινητήρας θα μειώσει την ισχύ του και θα διατηρήσει αυτή την ταχύτητα αντί να επιταχύνει περισσότερο.",
      p6:
        "Οι διακόπτες στο επάνω μέρος της εφαρμογής σας επιτρέπουν να εμφανίζετε αυτόματα μετατρεπόμενες τιμές (τρέχουσες και ταχύτητες ή ποσοστά).",
      endText:
        "Όταν τελειώσετε με τη ρύθμιση των επιπέδων υποβοήθησης, μπορείτε να χρησιμοποιήσετε το κουμπί WRITE σε αυτή την καρτέλα του προγράμματος για να τις γράψετε στο χειριστήριο. Μπορείτε επίσης να χρησιμοποιήσετε το κουμπί READ ανά πάσα στιγμή για να τις διαβάσετε (αυτό θα αντικαταστήσει όλες τις τιμές στα Assist Levels. Αυτό δεν θα αντικαταστήσει οποιεσδήποτε άλλες ρυθμίσεις.",
    },
    pedal: {
      header: "Υποβοήθηση πεντάλ",
      p1:
        "Το σύστημα Pedal Assist σας βοηθάει ενώ κάνετε πετάλι. Σε αυτή την καρτέλα μπορείτε να ρυθμίσετε την απόδοσή του. Κάποια από αυτά δεν θα πρέπει να τα αλλάξετε, καθώς είναι συγκεκριμένα για το κιτ σας. Αυτά ρυθμίζονται από τον κατασκευαστή.",
      pedalSensorType:
        "Αυτή η παράμετρος επιλέγει τον τύπο αισθητήρα περιστροφής πεντάλ. Ορίζεται από τον κατασκευαστή και δεν πρέπει να τροποποιηθεί.",
      designatedAssistLevel:
        'Έχετε επιλέξει δύο τύπους λειτουργίας με αυτή την παράμετρο. Ο πρώτος είναι "Με εντολή της οθόνης". Αυτό σημαίνει ότι το επίπεδο υποβοήθησης (αυτό από την καρτέλα Βασικές ρυθμίσεις) θα επιλεγεί από την οθόνη LCD σας. Η δεύτερη επιλογή είναι να επιλέξετε ένα συγκεκριμένο επίπεδο υποβοήθησης το οποίο θα είναι σταθερό και δεν θα μπορείτε να το αλλάξετε από την οθόνη LCD. Για το σκοπό αυτό μπορείτε να επιλέξετε οποιοδήποτε επίπεδο υποβοήθησης από το 0 έως το 9.',
      speedLimit:
        'Αυτή είναι η μέγιστη ταχύτητα στην οποία ο κινητήρας θα παρέχει πρόσθετη επιτάχυνση. Όταν επιτευχθεί η ταχύτητα, θα τη διατηρήσει μόνο αλλά δεν θα επιταχύνει περισσότερο. Εάν ορίσετε αυτή την παράμετρο σε "Με εντολή της οθόνης", θα μπορείτε να ρυθμίσετε την ταχύτητα από την οθόνη LCD. Λάβετε υπόψη ότι ορισμένες LCD σας επιτρέπουν να ορίσετε ταχύτητα 99km/h, κάτι που δεν είναι δυνατό τουλάχιστον με τα τρέχοντα κιτ BBS. Απ\' όσο έχω δοκιμάσει, η μέγιστη ταχύτητα χωρίς πετάλι είναι 40km/h (όταν το μέγεθος του τροχού έχει ρυθμιστεί σωστά). Αυτή η ρύθμιση χρησιμοποιείται για όλα τα επίπεδα υποβοήθησης που βλέπετε στην καρτέλα Basic. Εάν ρυθμίσετε αυτή την τιμή στα 40km/h (σε αυτό το πρόγραμμα ή από την οθόνη LCD) και το επίπεδο Assist 5 έχει ρυθμιστεί στην ταχύτητα 50%, τότε θα μπορείτε να φτάσετε τα 20km/h σε αυτό το επίπεδο υποβοήθησης.',
      startCurrent:
        "Αυτό είναι το ρεύμα εκκίνησης όταν αρχίζετε να περιστρέφετε τα πεντάλ. Είναι καλό να το ρυθμίσετε σε τουλάχιστον 10% για να βεβαιωθείτε ότι το ποδήλατο θα αρχίσει να κινείται και ο κινητήρας δεν θα ακινητοποιηθεί. Αν το ρυθμίσετε σε πολύ υψηλή τιμή, το ποδήλατο θα επιταχύνει πολύ γρήγορα κατά την εκκίνηση, γεγονός που μπορεί να προκαλέσει ζημιά στα εσωτερικά γρανάζια του, αλλά και στον κινητήρα. Η συνιστώμενη τιμή είναι μεταξύ 10% και 30%. Θα πρέπει επίσης να βεβαιωθείτε ότι δεν ξεκινάτε να κάνετε πετάλι με πολύ υψηλή ταχύτητα, η οποία θα φορτίσει πολύ τον κινητήρα.",
      slowStartMode:
        "Αυτή η ρύθμιση ελέγχει πόσο γρήγορα επιτυγχάνεται το ρεύμα εκκίνησης. Μπορείτε να κάνετε το ποδήλατό σας να επιταχύνει ομαλά και να ανταποκρίνεται γρήγορα. Μια τιμή γύρω στο 4 λειτουργεί συνήθως καλά για κανονική ποδηλασία. Αν είστε ποδηλάτης βουνού, τότε η ρύθμιση σε χαμηλή τιμή θα κάνει την επιτάχυνση πιο γρήγορη, πράγμα που μπορεί να είναι χρήσιμο, αλλά θα πρέπει να προσέξετε να μην κάψετε τον ελεγκτή και τον κινητήρα σας.",
      startDegree:
        "Αυτή η παράμετρος καθορίζει πόσοι παλμοί από τον αισθητήρα πεντάλ απαιτούνται για την εκκίνηση του κινητήρα. Η πλήρης περιστροφή του πεντάλ στα κιτ BBS παράγει 24 παλμούς. Η ρύθμιση αυτής της τιμής σε 0 ή 1 δεν θα λειτουργήσει. Μια τιμή γύρω στο 4 λειτουργεί καλά, καθώς δεν ξεκινάει με μια μικρή μόνο κίνηση και επίσης δεν απαιτεί πολύ μεγάλη περιστροφή.",
      workMode:
        "Ο σκοπός αυτής της παραμέτρου δεν είναι πολύ σαφής. Υποτίθεται ότι ελέγχει την ισχύ ανάλογα με την ταχύτητα περιστροφής του πεντάλ. Η τιμή που έχει οριστεί από τον κατασκευαστή φαίνεται να λειτουργεί μια χαρά, οπότε δεν χρειάζεται να την αλλάξετε.",
      stopDelay:
        "Αυτή είναι η καθυστέρηση μετά τη διακοπή του πεντάλ πριν σταματήσει ο κινητήρας. Η τιμή των 250ms λειτουργεί καλά.",
      currentDecay:
        "Αυτή η παράμετρος καθορίζει πόσο γρήγορα πέφτει το ρεύμα όταν κάνετε πετάλι γρήγορα και φτάνετε στη μέγιστη ταχύτητα στο επιλεγμένο επίπεδο υποβοήθησης. Χαμηλότερη τιμή σημαίνει ότι το ρεύμα θα αρχίσει να πέφτει σε χαμηλότερη ταχύτητα.",
      stopDecay: "Ο χρόνος που χρειάζεται ο κινητήρας για να σταματήσει.",
      keepCurrent:
        "Αυτή η ρύθμιση ελέγχει το ποσοστό του μέγιστου ρεύματος στο επιλεγμένο επίπεδο υποβοήθησης που θα ρέει μέσω του κινητήρα όταν φτάσετε στη μέγιστη ταχύτητα και συνεχίσετε να κάνετε πετάλι. Έτσι, εάν το μέγιστο ρεύμα σας είναι 25Α και χρησιμοποιείτε το Pedal Assist 5 ρυθμισμένο στο 50% του ρεύματος, τότε θα έχετε μέγιστο ρεύμα 12,5Α για αυτό το επίπεδο υποβοήθησης. Στη συνέχεια, εάν η ρύθμιση Keep Current (Διατήρηση ρεύματος) είναι στο 50% όταν φτάσετε στη μέγιστη ταχύτητα και συνεχίσετε να κάνετε πετάλι, το ρεύμα θα διατηρηθεί στα 6,25Α. Αυτό διασφαλίζει την ομαλή μετάβαση στην ισχύ υποβοήθησης όταν μειώνετε την ταχύτητα πετάλισης και η ταχύτητα κίνησης πέφτει κάτω από τη μέγιστη.",
      endText:
        "Όταν τελειώσετε με τη ρύθμιση των ρυθμίσεων του Pedal Assist, μπορείτε να χρησιμοποιήσετε το κουμπί WRITE σε αυτή την καρτέλα του προγράμματος για να τις γράψετε στο χειριστήριό σας. Μπορείτε επίσης να χρησιμοποιήσετε το κουμπί READ ανά πάσα στιγμή για να τις διαβάσετε (αυτό θα αντικαταστήσει όλες τις τιμές στο Pedal Assist. Αυτό δεν θα αντικαταστήσει οποιεσδήποτε άλλες ρυθμίσεις.",
    },
    throttle: {
      header: "Χειρολαβή γκαζιού",
      p1:
        "Εάν το κιτ σας είναι εξοπλισμένο με χειρολαβή γκαζιού, αυτή η καρτέλα σας επιτρέπει να ρυθμίσετε τη λειτουργία του. Βεβαιωθείτε ότι το Assis 0 είναι ρυθμισμένο σε 1 (τόσο για το ρεύμα όσο και για την ταχύτητα) εάν θέλετε να το χρησιμοποιήσετε όταν το Pedal Assist S0 είναι επιλεγμένο στην οθόνη LCD.",
      startVoltage:
        "Αυτή είναι η τάση εξόδου της χειρολαβής του γκαζιού στην οποία θα ξεκινήσει ο κινητήρας. Η ελάχιστη τιμή στην οποία ανταποκρίνεται ο ελεγκτής είναι 1,1V.",
      endVoltage:
        "Αυτή είναι η τάση εξόδου της χειρολαβής γκαζιού στην οποία ο κινητήρας θα φτάσει στη μέγιστη ισχύ του (περιορίζεται από άλλες ρυθμίσεις). Η μέγιστη αποδεκτή τιμή από τον ελεγκτή είναι 4,2V. Πρέπει να παίξετε λίγο με αυτή την παράμετρο, καθώς η μέγιστη τιμή της λαβής γκαζιού μπορεί να είναι διαφορετική ανάλογα με το μοντέλο. Εάν ρυθμίσετε αυτή την παράμετρο πολύ χαμηλά, δεν θα έχετε σχεδόν καμία απόκριση από τη λαβή του γκαζιού. Όταν τη ρυθμίσετε στο μέγιστο που μπορεί να παράγει η λαβή γκαζιού, θα έχετε το ευρύτερο δυνατό εύρος ελέγχου της ισχύος του κινητήρα.",
      mode:
        "Αυτός είναι ο τρόπος λειτουργίας της χειρολαβής του γκαζιού. Έχετε δύο επιλογές: ταχύτητα και ρεύμα. Όταν είναι ρυθμισμένο στην ταχύτητα, ο ελεγκτής χρησιμοποιεί την ταχύτητα κίνησης για να ρυθμίσει την ισχύ του κινητήρα ανάλογα με τη θέση της χειρολαβής του γκαζιού. Δυστυχώς υπάρχει σημαντική καθυστέρηση λόγω του τρόπου μέτρησης της ταχύτητας και η απόκριση είναι αρκετά κακή σε αυτή τη λειτουργία. Όταν έχει οριστεί σε ρεύμα, η λαβή ελέγχει το ρεύμα του κινητήρα σύμφωνα με τη θέση της. Αυτή η λειτουργία λειτουργεί καλύτερα και παρόμοια με τη λειτουργία ενός αυτοκινήτου.",
      designatedAssistLevel:
        'Μπορείτε να το ορίσετε σε "Με εντολή της οθόνης" ή να επιλέξετε ένα σταθερό επίπεδο. Η πρώτη επιλογή χρησιμοποιεί τη ρύθμιση PAS από την οθόνη LCD σας. Αυτό σημαίνει ότι η μέγιστη ισχύς εξόδου και η ταχύτητα εξαρτώνται από το επιλεγμένο επίπεδο PAS και τη θέση της χειρολαβής του γκαζιού. Έτσι, εάν έχει επιλεγεί ένα χαμηλό PAS, το μέγιστο ρεύμα και η ταχύτητα θα είναι επίσης χαμηλά, ακόμη και αν πιέσετε το γκάζι στο μέγιστο. Εάν έχει επιλεγεί ένα σταθερό επίπεδο υποβοήθησης για αυτή την παράμετρο, η λαβή του γκαζιού θα χρησιμοποιεί το μέγιστο ρεύμα και την ταχύτητα. Προσέξτε εάν ρυθμίσετε αυτό το επίπεδο στο επίπεδο 9 να μην πιέσετε το γκάζι στο μέγιστο όταν είστε σταματημένοι γιατί το υψηλό ρεύμα και η ισχύς θα μπορούσαν να προκαλέσουν ζημιά στο χειριστήριο και στον κινητήρα.',
      speedLimit:
        "Με αυτή την παράμετρο μπορείτε να περιορίσετε τη μέγιστη ταχύτητα όταν χρησιμοποιείτε τη λαβή του γκαζιού. Αυτό αντικαθιστά τη μέγιστη ταχύτητα του καθορισμένου επιπέδου υποβοήθησης, εάν αυτή είναι υψηλότερη.",
      startCurrent:
        "Αυτό είναι το ποσοστό του μέγιστου ρεύματος που εφαρμόζεται στον κινητήρα όταν η λαβή του γκαζιού παράγει την ελάχιστη αποδεκτή τάση. Συνήθως η τιμή του 10% ή 20% λειτουργεί καλά. Εάν το μέγιστο ρεύμα στην καρτέλα General (Γενικά) έχει οριστεί στα 25A και το Start Current (Ρεύμα εκκίνησης) έχει οριστεί στο 10%, θα έχετε ρεύμα εκκίνησης 2,5A. Αυτό θα οδηγήσει σε ομαλή εκκίνηση και δεν θα επιβαρύνει υπερβολικά τα εσωτερικά γρανάζια. Εάν ρυθμίσετε αυτή την παράμετρο σε πολύ υψηλή τιμή, μπορεί να προκαλέσετε ζημιά στα εσωτερικά γρανάζια και στον κινητήρα.",
      endText:
        "Όταν τελειώσετε με τη ρύθμιση των ρυθμίσεων της χειρολαβής γκαζιού, μπορείτε να χρησιμοποιήσετε το κουμπί WRITE σε αυτή την καρτέλα του προγράμματος για να τις γράψετε στο χειριστήριο. Μπορείτε επίσης να χρησιμοποιήσετε το κουμπί READ ανά πάσα στιγμή για να τις διαβάσετε (αυτό θα αντικαταστήσει όλες τις τιμές στη χειρολαβή γκαζιού. Αυτό δεν θα αντικαταστήσει οποιεσδήποτε άλλες ρυθμίσεις.",
    },
  },
};
